Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCoincidingSplittingWorkplanes Property
 Coinciding splitting workplanes are encountered
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCoincidingSplittingWorkplanes { get; }
Public Shared ReadOnly Property DividedSurfaceCoincidingSplittingWorkplanes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCoincidingSplittingWorkplanes {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCoincidingSplittingWorkplanes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace